//╔════════════════════════════════════════════════════════════════════════════════════════════════╗
//║ (c) Patriarch, 2023                                                                            ║
//║     Загаловочный файл с объявлением констант и пространства имен под них.                      ║
//╚════════════════════════════════════════════════════════════════════════════════════════════════╝
#ifndef CONSTANTS_H
#define CONSTANTS_H

// Определение собственного пространства имен с константами
namespace cst
{
    // Максимальное и минимальное количество символов в английском алфавите
    constexpr std::int32_t MIN_SIZE_ALPHABET {0};
    constexpr std::int32_t MAX_SIZE_ALPHABET {26};

    // Массивы английских символов
    constexpr char CHAR_HIGH[] {'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',
                                'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T',
                                'U', 'V', 'W', 'X', 'Y', 'Z'};
    constexpr char CHAR_LOW[]  {'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
                                'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't',
                                'u', 'v', 'w', 'x', 'y', 'z'};
}

#endif
