//╔════════════════════════════════════════════════════════════════════════════════════════════════╗
//║ (c) Patriarch, 2023                                                                            ║
//║     Загаловочный файл с объявлением функций.                                                   ║
//╚════════════════════════════════════════════════════════════════════════════════════════════════╝
#ifndef DESFUN_H
#define DESFUN_H

// Шифрование и расшифровка строки
std::string encdec(const std::uint16_t fEncDec, const std::string &strInput, const std::int32_t iKey);

#endif
