/*++

    Copyright (c) S-Patriarch, 2023

    Определение функций, реализующих информационный механизм чата.

--*/

#ifndef __CHAT_INFO_H__
#define __CHAT_INFO_H__

#ifdef _WIN32
#pragma once
#endif

//////////////////////////////////////////////////////////////////////
namespace chat
{
//-------------------------------------------------------------------- 
// Функция выводит выводит информацию при начальной загрузки чата.
//
    void get_logo();

//-------------------------------------------------------------------- 
// Функция выводит информацию чата.
//
    void get_info();

//-------------------------------------------------------------------- 
// Функция выводит информацию о чате и управляющих
// параметрах работы чата.
//
    void get_help();

} // namespace chat

#endif // __CHAT_INFO_H__