/*++

    Copyright (c) S-Patriarch, 2023
    (PTL) Patriarch library : pconio.h

    Работа с терминалом (консолью).

Функции:

    setlocale_WIN32_rus - локализация консоли ОС Windows для вывода
    setconsole_WIN32_rus - локализация консоли ОС Windows для ввода/вывода
    clrscr - очистка терминала
    clreol - удаляет все символы после курсора до конца строки
    gotoxy - постановка курсора в координаты _x и _y терминала
    where_x - возвращает установленную координату text._S_cur_x
    where_y - возвращает установленную координату text._S_cur_y
    hcrs - скрыть курсор
    scrs - показать курсор

--*/

#ifndef __PTL_PCONIO_H__
#define __PTL_PCONIO_H__

#ifdef _WIN32
#pragma once
#endif

#include <iostream>

#ifdef _WIN32
#include <clocale>
#include <windows.h>
#endif

typedef unsigned short int  __u16;

namespace ptl
{
    struct textinfo {
        __u16  _S_cur_x{ 0 };
        __u16  _S_cur_y{ 0 };
    } text;

//--------------------------------------------------------------------
// Локализация консоли ОС Windows для вывода
// текста на русском языке.
// 
    void 
    setlocale_WIN32_rus()
    {
        #ifdef _WIN32
            setlocale(LC_ALL, "Russian");
        #endif
    }

//--------------------------------------------------------------------
// Локализация консоли ОС Windows для ввода/вывода
// текста на русском языке.
// 
    void 
    setconsole_WIN32_rus()
    {
        #ifdef _WIN32
            SetConsoleCP(1251);
            SetConsoleOutputCP(1251);
        #endif
    }

//--------------------------------------------------------------------
// Очистка терминала и постановка курсора в 
// верхний левый угол.
//
    void 
    clrscr() 
    { std::cout << "\033[2J\033[1;1H"; }

//--------------------------------------------------------------------
// Удаляет все символы, находящиеся после курсора и до конца
// строки, но не удаляет символы, расположенные перед
// текущей позицией курсора.
//
    void 
    clreol() 
    { std::cout << "\033[K"; }

//--------------------------------------------------------------------
// Постановка курсора в координаты _x и _y терминала.
// 
    void 
    gotoxy(
        __u16  _x, 
        __u16  _y
        )
    { 
        std::cout << "\033[" 
                  << _y 
                  << ";" 
                  << _x 
                  << "H";

        text._S_cur_x = _x;
        text._S_cur_y = _y;
    }

//--------------------------------------------------------------------
// Возвращает установленную координату text._S_cur_x.
// 
    __u16 
    where_x() 
    { return text._S_cur_x; }

//--------------------------------------------------------------------
// Возвращает установленную координату text._S_cur_y.
// 
    __u16 
    where_y() 
    { return text._S_cur_y; }

//--------------------------------------------------------------------
// Скрыть курсор.
// 
    void 
    hcrs() 
    { std::cout << "\033[?25l"; }

//--------------------------------------------------------------------
// Показать курсор.
// 
    void 
    scrs() 
    { std::cout << "\033[?25h"; }
}

#endif